{
 "cells": [
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Nombre del estudiante: Manuel Guerrero Moñús"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "![](https://informatica.ucm.es/themes/ucm16/media/img/logo.png)\n",
    "\n",
    "# Máster en Ingeniería Informática\n",
    "\n",
    "\n",
    "### SGDI\n",
    "\n",
    "#### Práctica 2\n",
    "\n",
    "Partimos de dos ficheros de tweets:\n",
    "\n",
    " - [minitweet](https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/minitweet.json): muestra de tweets de las elecciones USA 2020\n",
    " - [miniuser](https://raw.githubusercontent.com/RafaelCaballero/tdm/master/datos/miniuser.json): datos de usuarios que han emitido esos tweets\n",
    " \n",
    " Conviene descargarlos y dejarlos en una carpeta, por ejemplo c:/hlocal/sgdi y luego desde la consola (en el laboratorio elegir la consola de Mongo)\n",
    " \n",
    "         mongoimport  -d usa -c tweet --drop --file c:\\hlocal\\sgdi\\minitweet.json\n",
    "         mongoimport  -d usa -c user --drop --file c:\\hlocal\\sgdi\\miniuser.json\n",
    "\n",
    " \n",
    " que debe importar, respectivamente, 3820 y 3789 documentos. Otra posibilidad es utilizar MongoCompass para la importación.\n",
    " \n",
    " Recordar que antes hay que tener inicializado un servidor. Si es en local lo normal es hacer desde un terminal\n",
    " \n",
    "     mongod -dbpath datos \n",
    "     \n",
    " con datos una carpeta nueva. Este terminal lo dejaremos aparte, podemos minimizarlo pero no cerrarlo.\n",
    " \n",
    " También interesa tener otro terminal con una shell de MongoDB\n",
    " \n",
    "     mongo usa\n",
    "     \n",
    "Por ejemplo, para ver el aspecto de los tweets:\n",
    "\n",
    "    > db.tweet.find().pretty()\n",
    " \n",
    " Nota: en los laboratorios iniciar la consola que sale con nombre \"entorno MongoDB\" o similar para Mongo."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Bibliotecas Python\n",
    "\n",
    "Este código carga las librerías y debería instalarlas si no existen; si las tiene que instalar quizás haya que reiniciar el notebook (Kernel + Restart)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Pymongo está en el sistema!\npprint está en el sistema!\nibm_watson está en el sistema!\nredis está en el sistema!\n"
     ]
    }
   ],
   "source": [
    "import warnings\n",
    "warnings.filterwarnings('ignore')\n",
    "\n",
    "# pymongo\n",
    "try:\n",
    "    import pymongo\n",
    "    print(\"Pymongo está en el sistema!\")\n",
    "except ImportError as e:\n",
    "    !{sys.executable} -m pip install --upgrade --user pymongo\n",
    "    \n",
    "# pprint\n",
    "try:\n",
    "    import pprint\n",
    "    from pprint import pprint\n",
    "    print(\"pprint está en el sistema!\")\n",
    "\n",
    "except ImportError as e:\n",
    "    !{sys.executable} -m pip install --upgrade --user pprint\n",
    "\n",
    "# ibm-watson\n",
    "try:\n",
    "    import ibm_watson\n",
    "    print(\"ibm_watson está en el sistema!\")\n",
    "except ImportError as e:\n",
    "    !{sys.executable} -m pip install --upgrade --user ibm-watson\n",
    "    \n",
    "# redis\n",
    "try:\n",
    "    import redis\n",
    "    print(\"redis está en el sistema!\")\n",
    "except ImportError as e:\n",
    "    !{sys.executable} -m pip install --upgrade --user redis\n",
    "    "
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Cadena de conexión para MongoDB\n",
    "\n",
    "Si tenemos el servidor en local en el puerto por defecto, no habrá que tocar nada. Si no habrá que poner la cadena correcta (por ejemplo las que nos de Atlas, si tenemos ahí el servidor)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Conectado a MongoDB, versión 4.4.1\nColección  tweet . Total documentos:  3820\nColección  user . Total documentos:  3789\n"
     ]
    }
   ],
   "source": [
    "from pymongo import MongoClient\n",
    "\n",
    "# Atlas (reemplazar)\n",
    "#conexion = \"mongodb+srv://usuario:passwd@cluster0.nubot.mongodb.net/<dbname>?retryWrites=true&w=majority\"\n",
    "\n",
    "# local\n",
    "conexion = 'mongodb://127.0.0.1:27017/'\n",
    "\n",
    "client = MongoClient(conexion)\n",
    "\n",
    "# código para ver si se ha conectado bien\n",
    "try:\n",
    "    s = client.server_info() # si hay error tendremos una excepción\n",
    "    print(\"Conectado a MongoDB, versión\",s[\"version\"])\n",
    "    db = client.usa\n",
    "    colecciones = db.list_collection_names()\n",
    "    for col in colecciones:\n",
    "        print('Colección ',col,'. Total documentos: ',db[col].count_documents({})) \n",
    "except:\n",
    "    print (\"connection error\")"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Cadena de conexión con Redis\n",
    "\n",
    "Completar los datos para conectar a Redis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "True"
      ]
     },
     "metadata": {},
     "execution_count": 12
    }
   ],
   "source": [
    "#### Cambiar los datos para  poner los de nuestra conexión Redis\n",
    "redisconexion = 'localhost' \n",
    "redispuerto = 6379 # Default\n",
    "# passwd = \n",
    "import redis\n",
    "r = redis.Redis(host=redisconexion, port=redispuerto, charset=\"utf-8\", decode_responses=True, db=0) # password=passwd,\n",
    "r.ping() # debe mostrar True"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Conexión con Watson\n",
    "\n",
    "Poner la clavesAPI de la cuenta Watson"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "{'emotion': {'document': {'emotion': {'anger': 0.112791,\n                                      'disgust': 0.214052,\n                                      'fear': 0.009007,\n                                      'joy': 0.609512,\n                                      'sadness': 0.125144}},\n             'targets': [{'emotion': {'anger': 0.059561,\n                                      'disgust': 0.070374,\n                                      'fear': 0.013004,\n                                      'joy': 0.68538,\n                                      'sadness': 0.067148},\n                          'text': 'place'},\n                         {'emotion': {'anger': 0.369894,\n                                      'disgust': 0.092936,\n                                      'fear': 0.118517,\n                                      'joy': 0.072837,\n                                      'sadness': 0.48603},\n                          'text': 'waiters'}]},\n 'language': 'en',\n 'sentiment': {'document': {'label': 'positive', 'score': 0.587216},\n               'targets': [{'label': 'positive',\n                            'score': 0.994893,\n                            'text': 'place'},\n                           {'label': 'negative',\n                            'score': -0.864582,\n                            'text': 'waiters'}]},\n 'usage': {'features': 2, 'text_characters': 618, 'text_units': 1}}\n"
     ]
    }
   ],
   "source": [
    "claveAPI = '_f9D239WFkmgESZGKJbMXm2TrGs4gXbWSojyEGlq1mxw'\n",
    "url = 'https://api.eu-gb.natural-language-understanding.watson.cloud.ibm.com/instances/0852f6b5-7c99-4142-baf0-35ba7d4fa0c3'\n",
    "\n",
    "import json\n",
    "from ibm_watson import NaturalLanguageUnderstandingV1\n",
    "from ibm_watson.natural_language_understanding_v1 import Features, EntitiesOptions, KeywordsOptions\n",
    "from ibm_cloud_sdk_core.authenticators import IAMAuthenticator\n",
    "from pprint import pprint # para mostrar los json bonitos\n",
    "\n",
    "# Authentication via IAM\n",
    "def conexion_watson(claveAPI,url):\n",
    "    authenticator = IAMAuthenticator(claveAPI)\n",
    "    service = NaturalLanguageUnderstandingV1(\n",
    "         version='2020-10-09',\n",
    "         authenticator=authenticator)\n",
    "    service.set_service_url(url)\n",
    "    return service\n",
    "\n",
    "\n",
    "def analisis_sentimiento(service,texto,lang,targets):\n",
    "    return service.analyze(\n",
    "                        text=texto,\n",
    "                        language= lang,\n",
    "                        features= {\n",
    "                            \"sentiment\": {\n",
    "                              \"targets\": targets\n",
    "                            },\n",
    "                            \"emotion\": {\n",
    "                              \"targets\": targets\n",
    "                            }                          }\n",
    "                            ).get_result()\n",
    "\n",
    "service = conexion_watson(claveAPI,url)\n",
    "\n",
    "texto = \"\"\"I absolutely love this place and would recommend it to anybody under one condition: the level of the service needs to be the same by all members of the staff. There are two waiters, who are the nicest guys ever, especially the guy with the glasses (shame I don't know his name) but there are a few waiters who seem to be hating their jobs, no smile, no nothing, it literally makes you feel uncomfortable to be served by them.\n",
    "Patatas Lia with egg yolk and truffle is a must, the place is very well priced, the tapas offered with the drinks are diverse and of good quality, the restaurant overall has a nice feel to it.\"\"\"\n",
    "salida = analisis_sentimiento(service,texto,\"en\",[\"place\",\"waiters\"])\n",
    "pprint(salida)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Pregunta 1  [1 punto]\n",
    "\n",
    "Escribir una función tweets(s) que dado un `screen_name` devuelva el número de tweets que ha emitido el usuario s."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {},
   "outputs": [],
   "source": [
    "def tweets(s):\n",
    "    return db[\"tweet\"].find({\"screen_name\":s}).count()"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "3\n2\n0\n"
     ]
    }
   ],
   "source": [
    "# para probar\n",
    "print(tweets(\"VLovesAnimals\"))\n",
    "print(tweets(\"SecondHandRocks\"))\n",
    "print(tweets(\"Bertoldo\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Pregunta 2 (1.5 puntos)\n",
    "\n",
    "Supongamos que hemos descubierto que se llama muy a menudo a la función `tweets`, y a menudo para los mismos usuarios. Para evitar recalcular el número de tweets decidimos emplear Redis como caché. \n",
    "\n",
    "Escribir una función `tweets_cache(s)` que:\n",
    "\n",
    "* Si el valor `s` existe ya como clave en Redis, escriba el valor  `s` seguido de \"en caché\" devuelva su número asociado. Además, la función debe incrementar el contador de accesos a esta clave y mostrar el número tras el incremento. Además hace que su vida vuelva a ser de 3 segundos.\n",
    "\n",
    "* Si el valor s no existe como clave, muestre por pantalla escriba el valor  `s` seguido de \"nuevo\", llame a tweets(s), añada s como clave con una vida de 3 segundos y como valor el devuelto por tweets, y apunte también que el número de accesos a esta clave en caché momento es 0\n",
    "\n",
    "Recordar que la variable `r` es nuestro acceso a Redis"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 23,
   "metadata": {},
   "outputs": [],
   "source": [
    "def tweets_cache(s):\n",
    "\n",
    "    resultAccesses = r.mget([s + ':result', s + ':accesses'])\n",
    "\n",
    "    if resultAccesses[0] == None or resultAccesses[1] == None:\n",
    "        # Según la documentación todas las claves se establecen a la vez.\n",
    "        r.msetnx({s + ':result': tweets(s), s + ':accesses': -1}) # Atómico\n",
    "\n",
    "    # La primera vez se establecerá en 0 (sin accesos), luego ya serán significativos.\n",
    "    accesses = r.incr(s + ':accesses', amount=1) # Atómico\n",
    "    \n",
    "    # Mensajes por pantalla.\n",
    "    print(s, \"en caché\\naccesos \" + str(accesses) if accesses > 0 else \"nuevo\")\n",
    "\n",
    "    # Establecemos el tiempo de vida en 3 segundos.\n",
    "    r.expire(s + ':result', 3)\n",
    "    r.expire(s + ':accesses', 3)\n",
    "\n",
    "    # Devolvemos el resultado.\n",
    "    return r.get(s + ':result') # No atómico."
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Para probar. La salida esperada es:\n",
    "\n",
    "    VLovesAnimals  nuevo\n",
    "    3\n",
    "    VLovesAnimals  en caché \n",
    "    accesos  1\n",
    "    3\n",
    "    SecondHandRocks  nuevo\n",
    "    2\n",
    "    Bertoldo  nuevo\n",
    "    0\n",
    "    SecondHandRocks  en caché \n",
    "    accesos  1\n",
    "    2\n",
    "    Bertoldo  en caché \n",
    "    accesos  1\n",
    "    0\n",
    "    2 segundos más....\n",
    "    SecondHandRocks  en caché \n",
    "    accesos  2\n",
    "    2\n",
    "    VLovesAnimals  nuevo\n",
    "    3\n",
    "    Bertoldo  en caché \n",
    "    accesos  2\n",
    "    0\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "VLovesAnimals nuevo\n",
      "3\n",
      "VLovesAnimals en caché\n",
      "accesos 1\n",
      "3\n",
      "SecondHandRocks nuevo\n",
      "2\n",
      "Bertoldo nuevo\n",
      "0\n",
      "SecondHandRocks en caché\n",
      "accesos 1\n",
      "2\n",
      "Bertoldo en caché\n",
      "accesos 1\n",
      "0\n",
      "2 segundos más....\n",
      "SecondHandRocks en caché\n",
      "accesos 2\n",
      "2\n",
      "VLovesAnimals nuevo\n",
      "3\n",
      "Bertoldo en caché\n",
      "accesos 2\n",
      "0\n"
     ]
    }
   ],
   "source": [
    "import time\n",
    "print(tweets_cache(\"VLovesAnimals\"))\n",
    "print(tweets_cache(\"VLovesAnimals\"))\n",
    "time.sleep(2)\n",
    "print(tweets_cache(\"SecondHandRocks\"))\n",
    "print(tweets_cache(\"Bertoldo\"))\n",
    "print(tweets_cache(\"SecondHandRocks\"))\n",
    "print(tweets_cache(\"Bertoldo\"))\n",
    "print(\"2 segundos más....\")\n",
    "time.sleep(2)\n",
    "print(tweets_cache(\"SecondHandRocks\"))\n",
    "print(tweets_cache(\"VLovesAnimals\"))\n",
    "print(tweets_cache(\"Bertoldo\"))"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Pregunta 3 [3 puntos]\n",
    "\n",
    "Para cada uno de los tweets que verifiquen todas las condiciones siguientes:\n",
    "\n",
    "* Estár escritos en inglés (examinar la clave lang)\n",
    "* No ser retweets (clave RT a False)\n",
    "* Tener al menos 2 retweets en el conjunto (clave nRT)\n",
    "\n",
    "se pide: \n",
    "\n",
    "1.- Aplicar el método análisis de sentimiento a la clave `text` con las claves correspondientes y como targets\n",
    "['@JoeBiden', '@realDonaldTrump'] (recordar que la variable `service` ya ha sido creada en la prueba de Watson).\n",
    "\n",
    "2.- Añadir al documento tweet correspondiente dos campos, uno 'sentiment' con el campo 'sentiment' devuelto por Watson y otro 'emotion' con el campo 'emotion'\n",
    "\n",
    "Nota 1: Solo hacerlo si el text incluye alguno de los strings en el array targets. Si no debe escribir \n",
    "\"No continene ningún target\" por pantalla\n",
    "\n",
    "Nota 2: Aunque incluye alguno de los targets, Watson puede devolver una excepción por no encontrarlos en un sitio que tenga sentido; encargarse de capturar esta excepción. Si esto sucede no se modificará el documento y se escribirá \"Fallo de Watson\". No importa que la biblioteca muestre algún warning por pantalla\n",
    "\n",
    "Nota 3: si la respuesta solo incluye emotion, solo se incluirá una nueva clave emotion, si solo incluye sentiment solo la clave sentiment, si incluye ambs se incluirán ambas, y si no incluye ninguna, ninguna\n",
    "\n",
    "Nota 4: se puede asumir que todos los tweets que verifican las condiciones anteriores incluyen la clave `text`\n",
    "\n",
    "Nota 5: el código debería funcionar al cambiar la variable targets por otros valores (incluyendo más o menos valores)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Encajan  3820  Modificados:  43\n",
      "ERROR:root:target(s) not found\n",
      "Traceback (most recent call last):\n",
      "  File \"/home/manuelgms/.local/lib/python3.8/site-packages/ibm_cloud_sdk_core/base_service.py\", line 224, in send\n",
      "    raise ApiException(\n",
      "ibm_cloud_sdk_core.api_exception.ApiException: Error: target(s) not found, Code: 400 , X-global-transaction-id: 98b9c5df0a1fa40494a1744dc9a78107\n",
      "Fallo de Watson\n"
     ]
    }
   ],
   "source": [
    "# esta instrucción elimina las claves sentiment y emotion, \n",
    "# de forma que se puede ejecutar varias veces este código comenzando siempre con el mismo estado de la base de datos\n",
    "result = db.tweet.update_many({},{\"$unset\":{\"sentiment\":True,\"emotion\":True}})\n",
    "print(\"Encajan \",result.matched_count,  \" Modificados: \",result.modified_count)\n",
    "\n",
    "targets = ['@JoeBiden', '@realDonaldTrump']\n",
    "\n",
    "# solución\n",
    "\n",
    "if len(targets) > 0:\n",
    "\n",
    "    for doc in db[\"tweet\"].find({\"lang\": \"en\", \"RT\": False, \"nRT\": {\"$gte\": 2}}):\n",
    "        \n",
    "        i = 0\n",
    "        makeAnalysis = False\n",
    "        while i < len(targets) and not makeAnalysis:\n",
    "            if targets[i] in doc['text']:\n",
    "                makeAnalysis = True\n",
    "            i += 1\n",
    "\n",
    "        if makeAnalysis:\n",
    "\n",
    "            try:\n",
    "\n",
    "                analisis = analisis_sentimiento(service,doc['text'],\"en\",targets)\n",
    "                \n",
    "                if \"emotion\" in analisis and \"sentiment\" in analisis:\n",
    "                    db[\"tweet\"].update({\"_id\": doc[\"_id\"]},{\"$set\":{\"emotion\":analisis[\"emotion\"],\"sentiment\":analisis[\"sentiment\"]}})\n",
    "                elif \"emotion\" in analisis:\n",
    "                    db[\"tweet\"].update({\"_id\": doc[\"_id\"]},{\"$set\":{\"emotion\":analisis[\"emotion\"]}})\n",
    "                elif \"sentiment\" in analisis:\n",
    "                    db[\"tweet\"].update({\"_id\": doc[\"_id\"]},{\"$set\":{\"sentiment\":analisis[\"sentiment\"]}})\n",
    "\n",
    "            except Exception as ex:\n",
    "                print(\"Fallo de Watson\")\n",
    "\n",
    "        else:\n",
    "            print(\"No continene ningún target\")\n"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Pregunta 4 [1.5 puntos]\n",
    "\n",
    "Nos interesa el número de retweets que ha recibido cada usuario. Por tanto, se pide:\n",
    "\n",
    "- Para cada documento de la colección user, modificar su documento añadiendo una clave `nretweets` que indique cuántos retweets en total ha recibido cada usuario en la colección tweet. \n",
    " \n",
    "Nota: esto se haría mejor con una función de agregación, pero aquí se pide hacerlo en Python (podemos decir hacerlo \"mal\"), sin usar aggregate, esto es: \n",
    "\n",
    "- Recorrer la colección de usuarios. Para cada usuario \n",
    "- sumar la clave `nRT` de los todos documentos de la colección `tweet` que tengan `RT` a `False` y cuyo `userid` coincida con el `_id` del usuario\n",
    "- Esa sumase añade al documento del usuario, como valor de la nueva clave `nretweets` \n",
    "- El documento modificado se graba en Mongo."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "Encajan  3789  Modificados:  3789\n"
     ]
    }
   ],
   "source": [
    "# esta instrucción elimina la clave nretweets, \n",
    "# de forma que se puede ejecutar varias veces este código comenzando siemple del mismo estado de la base de datos\n",
    "result = db.user.update_many({},{\"$unset\":{\"nretweets\":True}})\n",
    "print(\"Encajan \",result.matched_count,  \" Modificados: \",result.modified_count)\n",
    "\n",
    "# solución\n",
    "\n",
    "for userDoc in db[\"user\"].find():\n",
    "    totalRt = 0\n",
    "    for tweetDoc in db[\"tweet\"].find({\"RT\":False,\"userid\":userDoc[\"_id\"]}):\n",
    "        totalRt += tweetDoc[\"nRT\"]\n",
    "    db[\"user\"].update({\"_id\":userDoc[\"_id\"]},{\"$set\":{\"nretweets\":totalRt}})"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#### Pregunta 5 [1 punto]\n",
    "\n",
    "Mostrar el `screen_name`, el valor `nretweets` y número de seguidores (followers) de los 10 usuarios con  mayor valor en `nretweets`, ordenados por este valor de mayor a menor. Dentro de estos, para los que tengan el mismo valor en `nretweets`, ordenar por `followers`, también de mayor a menor.\n",
    "\n",
    "Pista para ordenar:\n",
    "https://stackoverflow.com/questions/8109122/how-to-sort-mongodb-with-pymongo\n",
    "\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "{'followers': 440010, 'nretweets': 1193, 'screen_name': 'TheRightMelissa'}\n{'followers': 206121, 'nretweets': 107, 'screen_name': 'davidmweissman'}\n{'followers': 146213, 'nretweets': 50, 'screen_name': 'toddstarnes'}\n{'followers': 22845, 'nretweets': 38, 'screen_name': 'the_resistor'}\n{'followers': 19469, 'nretweets': 33, 'screen_name': 'AgustinBerrios'}\n{'followers': 15, 'nretweets': 31, 'screen_name': 'AtleLarsen6'}\n{'followers': 435634, 'nretweets': 28, 'screen_name': 'RealMattCouch'}\n{'followers': 1449, 'nretweets': 20, 'screen_name': 'napmasters'}\n{'followers': 5028, 'nretweets': 18, 'screen_name': 'DianaWr48476186'}\n{'followers': 5081, 'nretweets': 15, 'screen_name': 'FamilyTruckster'}\n"
     ]
    }
   ],
   "source": [
    "for doc in db[\"user\"].find({},{\"_id\":0,\"screen_name\":1,\"nretweets\":1,\"followers\":1}).sort([(\"nretweets\", pymongo.DESCENDING), (\"followers\", pymongo.DESCENDING)]).limit(10):\n",
    "    pprint(doc)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Pregunta 6 [1 punto]\n",
    "\n",
    "Calcular el sentimiento medio de todos los targets considerados. \n",
    "No hay que utilizar la librería Watson, solo recorrer la colección tweet y busca dentro de la clave sentiment sus target y dentro sus (array targets), calculando para cada valor de \"text\" la media de sus scores. Se valorará hacerlo utilizando agregaciones.\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "metadata": {},
   "outputs": [
    {
     "output_type": "stream",
     "name": "stdout",
     "text": [
      "target: @JoeBiden , media: -0.304133\ntarget: @realDonaldTrump , media: -0.4348416470588235\n"
     ]
    }
   ],
   "source": [
    "for result in db[\"tweet\"].aggregate(\n",
    "                        [\n",
    "                            { \"$match\": { \"sentiment.targets\": {\"$exists\": True} } },\n",
    "                            { \"$project\": { \"_id\": 0 , \"target\": \"$sentiment.targets\" } },\n",
    "                            { \"$unwind\": { \"path\": \"$target\" } },\n",
    "                            { \"$group\": { \"_id\": \"$target.text\" , \"media\": {\"$avg\": \"$target.score\"} } }\n",
    "                        ]\n",
    "                    ):\n",
    "    print(\"target:\",result[\"_id\"], \", media:\", result[\"media\"])"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Ejecutar esto para no dejar accesos abiertos en redis, si se ponen demasiados al final da un error y se bloquea hasta horas después"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "metadata": {},
   "outputs": [],
   "source": [
    "r.close()\n",
    "client.close()"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "### Neo4j\n",
    "\n",
    "Esta parte no se hace desde anaconda, sino desde el web browser de neo4j. Solo se pide copair aquí las respuestas para tener todo en un mismo fichero"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "##### Pregunta 7 (1 punto)\n",
    "\n",
    "a) Escribir una consulta en Cypher que muestre los nodos que retuitean al Usuario con nombre 'TeamTrump'"
   ]
  },
  {
   "source": [
    "# solución\n",
    "\n",
    "'''\n",
    "MATCH (A:Usuario)-[:RT]->(B:Usuario{nombre:\"TeamTrump\"}) RETURN A\n",
    "'''"
   ],
   "cell_type": "code",
   "metadata": {},
   "execution_count": 14,
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "'\\nMATCH (A:Usuario)-[:RT]->(B:Usuario{nombre:\"TeamTrump\"}) RETURN A\\n'"
      ]
     },
     "metadata": {},
     "execution_count": 14
    }
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "b) Usuarios que no retuitean, ni directa ni indirectamente a TeamTrump (no hay camino de retweets desde ellos a TeamTrump)\n"
   ]
  },
  {
   "source": [
    "# solución\n",
    "\n",
    "'''\n",
    "MATCH (A:Usuario), (B:Usuario{nombre: \"TeamTrump\"})\n",
    "WHERE NOT (A)-[:RT*]->(B)\n",
    "RETURN A.nombre\n",
    "'''"
   ],
   "cell_type": "code",
   "metadata": {},
   "execution_count": 15,
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "'\\nMATCH (A:Usuario), (B:Usuario{nombre: \"TeamTrump\"})\\nWHERE NOT (A)-[:RT*]->(B)\\nRETURN A.nombre\\n'"
      ]
     },
     "metadata": {},
     "execution_count": 15
    }
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "c) Número de usuarios retuiteados por el usuario con nombre 'ErinMPerrine', que a su vez retuitean a este usuario (caminos de ida y vuelta con dos nodos)\n"
   ]
  },
  {
   "source": [
    "# solución\n",
    "\n",
    "'''\n",
    "MATCH (A:Usuario{nombre:\"ErinMPerrine\"})-[:RT]->(B:Usuario)\n",
    "WHERE (B)-[:RT]->(A)\n",
    "RETURN COUNT(B)\n",
    "'''"
   ],
   "cell_type": "code",
   "metadata": {},
   "execution_count": 16,
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "'\\nMATCH (A:Usuario{nombre:\"ErinMPerrine\"})-[:RT]->(B:Usuario)\\nWHERE (B)-[:RT]->(A)\\nRETURN COUNT(B)\\n'"
      ]
     },
     "metadata": {},
     "execution_count": 16
    }
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "d) Camino con 5 nodos en total (4 retweets) que lleve desde 'KatrinaPierson' hasta 'JasonMillerinDC', pero que no incluya a 'TeamTrump' entre sus nodos\n"
   ]
  },
  {
   "source": [
    "# solución\n",
    "\n",
    "'''\n",
    "MATCH PATH=(A:Usuario{nombre:\"KatrinaPierson\"})-[:RT*4]->(B:Usuario{nombre:\"JasonMillerinDC\"})\n",
    "WHERE ALL(N IN NODES(PATH) WHERE N.nombre <> \"TeamTrump\")\n",
    "RETURN PATH\n",
    "'''"
   ],
   "cell_type": "code",
   "metadata": {},
   "execution_count": 17,
   "outputs": [
    {
     "output_type": "execute_result",
     "data": {
      "text/plain": [
       "'\\nMATCH PATH=(A:Usuario{nombre:\"KatrinaPierson\"})-[:RT*4]->(B:Usuario{nombre:\"JasonMillerinDC\"})\\nWHERE ALL(N IN NODES(PATH) WHERE N.nombre <> \"TeamTrump\")\\nRETURN PATH\\n'"
      ]
     },
     "metadata": {},
     "execution_count": 17
    }
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "Al terminar, grabar el notebook y subirlo al campus virtual"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.8.5-final"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 2
}